In [ ]:
# 2 data structures are there in Pandas

# 1. Series - 1D array contains the values of the same type (numeric, character, datetime etc.)
# 2. Data Frame - 2D array with rows and columns

# Data Frames

In [1]:
cars_per_cap = [809, 731, 588, 18, 200, 70, 45]
country = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
drives_right = [False, True, True, True, False, False, False]

In [2]:
cars_dict={
    'cars_per_cap':[809, 731, 588, 18, 200, 70, 45],
    'country':['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt'],
    'drives_right':[False, True, True, True, False, False, False]
}

In [4]:
import pandas as pd
df=pd.DataFrame(cars_dict)

In [5]:
df.head()

   cars_per_cap        country  drives_right
0           809  United States         False
1           731      Australia          True
2           588          Japan          True
3            18          India          True
4           200         Russia         False

# Series

In [6]:
s = pd.Series([2, 4, 5, 6, 9])
print(s)
print(type(s))

0    2
1    4
2    5
3    6
4    9
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
date_series = pd.date_range(start = '11-09-2017', end = '12-12-2017')
date_series

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')

In [9]:
type(date_series)

pandas.core.indexes.datetimes.DatetimeIndex

# Loading external source

In [12]:
pd.read_csv('cars.csv', header=None,names=['Region','Code','Country','Price','Is right'])

  Region Code        Country  Price  Is right
0   USCA   US  United States  809.0     False
1  ASPAC  AUS      Australia  731.0      True
2  ASPAC  JAP          Japan  588.0      True
3  ASPAC   IN          India   18.0      True
4  ASPAC   RU         Russia  200.0     False
5  LATAM  MOR        Morocco   70.0     False
6    AFR   EG          Egypt   45.0     False
7    EUR  ENG        England    NaN      True

In [18]:
df=pd.read_csv('marks_1.csv',sep='|',header=None)

df

     0        1            2   3   4   5
0    1   Akshay  Mathematics  50  40  80
1    2   Mahima      English  40  33  83
2    3    Vikas  Mathematics  50  42  84
3    4  Abhinav      English  40  31  78
4    5   Mahima      Science  50  40  80
5    6   Akshay      Science  50  49  98
6    7  Abhinav  Mathematics  50  47  94
7    8    Vikas      Science  50  40  80
8    9  Abhinav      Science  50  47  94
9   10    Vikas      English  40  39  98
10  11   Akshay      English  40  35  88
11  12   Mahima  Mathematics  50  43  86

# Set Index

In [67]:
df=pd.read_csv('cars.csv', header=None,index_col=1)

In [68]:
df

         0              2      3      4
1
US    USCA  United States  809.0  False
AUS  ASPAC      Australia  731.0   True
JAP  ASPAC          Japan  588.0   True
IN   ASPAC          India   18.0   True
RU   ASPAC         Russia  200.0  False
MOR  LATAM        Morocco   70.0  False
EG     AFR          Egypt   45.0  False
ENG    EUR        England    NaN   True

In [69]:
df.index.name

1

In [29]:
del df.index.name   # df.index.name = None

AttributeError: can't delete attribute

In [70]:
df = df.rename_axis(index=None)

In [71]:
df

         0              2      3      4
US    USCA  United States  809.0  False
AUS  ASPAC      Australia  731.0   True
JAP  ASPAC          Japan  588.0   True
IN   ASPAC          India   18.0   True
RU   ASPAC         Russia  200.0  False
MOR  LATAM        Morocco   70.0  False
EG     AFR          Egypt   45.0  False
ENG    EUR        England    NaN   True

In [72]:
df.index.name="CC"

In [32]:
df.columns

Int64Index([0, 2, 3, 4], dtype='int64')

In [73]:
df.columns=['Region_code','Country','Cars_per_capita','Is_right']

In [74]:
df

    Region_code        Country  Cars_per_capita  Is_right
CC
US         USCA  United States            809.0     False
AUS       ASPAC      Australia            731.0      True
JAP       ASPAC          Japan            588.0      True
IN        ASPAC          India             18.0      True
RU        ASPAC         Russia            200.0     False
MOR       LATAM        Morocco             70.0     False
EG          AFR          Egypt             45.0     False
ENG         EUR        England              NaN      True

# Heirarchical Indexing

In [54]:
df=pd.read_csv('cars.csv', header=None,index_col=[0,1])

In [55]:
df

                       2      3      4
0     1
USCA  US   United States  809.0  False
ASPAC AUS      Australia  731.0   True
      JAP          Japan  588.0   True
      IN           India   18.0   True
      RU          Russia  200.0  False
LATAM MOR        Morocco   70.0  False
AFR   EG           Egypt   45.0  False
EUR   ENG        England    NaN   True

In [57]:
df.columns=['Country','Cars_per_capita','Is_right']

In [58]:
df

                 Country  Cars_per_capita  Is_right
0     1
USCA  US   United States            809.0     False
ASPAC AUS      Australia            731.0      True
      JAP          Japan            588.0      True
      IN           India             18.0      True
      RU          Russia            200.0     False
LATAM MOR        Morocco             70.0     False
AFR   EG           Egypt             45.0     False
EUR   ENG        England              NaN      True

In [60]:
df.index.names

FrozenList([0, 1])

In [61]:
print(df.index.names)

[0, 1]

In [62]:
df.index.names=['Region_Code','County_Code']

In [63]:
df

                               Country  Cars_per_capita  Is_right
Region_Code County_Code
USCA        US           United States            809.0     False
ASPAC       AUS              Australia            731.0      True
            JAP                  Japan            588.0      True
            IN                   India             18.0      True
            RU                  Russia            200.0     False
LATAM       MOR                Morocco             70.0     False
AFR         EG                   Egypt             45.0     False
EUR         ENG                England              NaN      True

In [64]:
df.index

MultiIndex([( 'USCA',  'US'),
            ('ASPAC', 'AUS'),
            ('ASPAC', 'JAP'),
            ('ASPAC',  'IN'),
            ('ASPAC',  'RU'),
            ('LATAM', 'MOR'),
            (  'AFR',  'EG'),
            (  'EUR', 'ENG')],
           names=['Region_Code', 'County_Code'])

# Test

In [118]:
n=5
s=pd.Series(np.arange(n))
s

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [102]:
import numpy as np
n=4
s=pd.Series(np.arange(1,n+1)**2)
s

0     1
1     4
2     9
3    16
dtype: int32

In [115]:
n=5
pd.Series(np.arange(1,n+1)**2,index=np.arange(1,n+1))

1     1
2     4
3     9
4    16
5    25
dtype: int32

In [123]:
n=4
arr=np.arange(1,n+1)
s=pd.Series(arr**2,index=arr)

In [124]:
print(s)

1     1
2     4
3     9
4    16
dtype: int32

In [129]:
df=pd.read_csv('marks_1.csv',sep='|',header=None,names=['Name','Subject','Maximum Marks','Marks Obtained','Percentage'])
df.index.name='S.No.'
df

          Name      Subject  Maximum Marks  Marks Obtained  Percentage
S.No.
1       Akshay  Mathematics             50              40          80
2       Mahima      English             40              33          83
3        Vikas  Mathematics             50              42          84
4      Abhinav      English             40              31          78
5       Mahima      Science             50              40          80
6       Akshay      Science             50              49          98
7      Abhinav  Mathematics             50              47          94
8        Vikas      Science             50              40          80
9      Abhinav      Science             50              47          94
10       Vikas      English             40              39          98
11      Akshay      English             40              35          88
12      Mahima  Mathematics             50              43          86